Feature spaces, Linear Algebra, Numeric data methods, Linear Regression
## Part 1

1. Feature space from csv file. Read `data/ds_salaries.csv` into a pandas dataframe

In [10]:
import pandas as pd

data = pd.read_csv('./my_data/ds_salaries.csv')

new_data = pd.DataFrame(data)

new_data

,Unnamed: 0,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,0,2020,MI,FT,Data Scientist,70000,EUR,79833,DE,0,DE,L
1,1,2020,SE,FT,Machine Learning Scientist,260000,USD,260000,JP,0,JP,S
2,2,2020,SE,FT,Big Data Engineer,85000,GBP,109024,GB,50,GB,M
3,3,2020,MI,FT,Product Data Analyst,20000,USD,20000,HN,0,HN,S
4,4,2020,SE,FT,Machine Learning Engineer,150000,USD,150000,US,50,US,L
...,...,...,...,...,...,...,...,...,...,...,...,...
602,602,2022,SE,FT,Data Engineer,154000,USD,154000,US,100,US,M
603,603,2022,SE,FT,Data Engineer,126000,USD,126000,US,100,US,M
604,604,2022,SE,FT,Data Analyst,129000,USD,129000,US,0,US,M
605,605,2022,SE,FT,Data Analyst,150000,USD,150000,US,100,US,M
606,606,2022,MI,FT,AI Scientist,200000,USD,200000,IN,100,US,L

2. Prune the dataset to only have columns: "work_year", "experience_level", "salary_in_usd", "job_title", "company_location", "company_size".

In [26]:
new_dataframe = new_data[["work_year", "experience_level", "salary_in_usd", "job_title", "company_location", "company_size"]]
new_dataframe

,work_year,experience_level,salary_in_usd,job_title,company_location,company_size
0,2020,MI,79833,Data Scientist,DE,L
1,2020,SE,260000,Machine Learning Scientist,JP,S
2,2020,SE,109024,Big Data Engineer,GB,M
3,2020,MI,20000,Product Data Analyst,HN,S
4,2020,SE,150000,Machine Learning Engineer,US,L
...,...,...,...,...,...,...
602,2022,SE,154000,Data Engineer,US,M
603,2022,SE,126000,Data Engineer,US,M
604,2022,SE,129000,Data Analyst,US,M
605,2022,SE,150000,Data Analyst,US,M
606,2022,MI,200000,AI Scientist,US,L

3. Onehot encode "experience_level". Hint: look up pandas: `get_dummies()` method.

In [24]:
pd.get_dummies(new_dataframe.experience_level, prefix="col")

     col_EN  col_EX  col_MI  col_SE
0         0       0       1       0
1         0       0       0       1
2         0       0       0       1
3         0       0       1       0
4         0       0       0       1
..      ...     ...     ...     ...
602       0       0       0       1
603       0       0       0       1
604       0       0       0       1
605       0       0       0       1
606       0       0       1       0

[607 rows x 4 columns]

4. labelencode "company_location"

In [92]:
from sklearn.preprocessing import OneHotEncoder
label_encoder = preprocessing.LabelEncoder()

ex = data['company_location']= label_encoder.fit_transform(data['company_location'])

data['company_location']

0      12
1      29
2      18
3      20
4      48
       ..
602    48
603    48
604    48
605    48
606    48
Name: company_location, Length: 607, dtype: int64

5. Normalize the company_location number (relative value between 0-1) ![](https://cdn-images-1.medium.com/max/253/1*Dl3P3Rrzto258X0Ales9Xw.png)

In [94]:
company_col = new_dataframe.columns
d = preprocessing.normalize(ex.reshape(-1,1))
scaled_df = pd.DataFrame(d, columns=company_col)
scaled_df.head()

ValueError: Shape of passed values is (607, 1), indices imply (607, 6)

6. Make binning of the salary column (both cut and qcut methods).

7. Make a barplot with binned salaries to show the company size count for each of the bins. Like this: 

<img src="images/binned_salaries.jpg" width=300/>

Hint: Use pandas Series unstack() method to get a dataframe from a multiindex Series object (The result of making a groupby count on both salary_bins and company_size columns

## Part 2
8. Make it into a function that can take either company_size or experience_level as arguments.

9. Change the experience_level column to be numeric using this dictionary: `experience = {'EN':10,'EX':20,'MI':30,'SE':40}`. Hint: [Here](https://sparkbyexamples.com/pandas/pandas-remap-values-in-column-with-a-dictionary-dict/).

10. Use seaborn pairplot to see if there is an approximately linear relationship between experience_level and salary

11. scatter Plot the 2d feature space of 'experience_level' and 'salary_in_usd

12. Use sklearn to find the best possible linear relationship between experience_level and salary_in_usd using linear regression.

## Part 3: Linear Algebra
Given the below dictionarys find out where each of the 4 people find the cheapest shopping according to their needs.
```python
shoppers = {
'Paula':{'Is':4,'Juice':2,'Kakao':3,'Lagkager':2},
'Peter':{'Is':2,'Juice':5,'Kakao':0, 'Lagkager':4},
'Pandora':{'Is':5,'Juice':3, 'Kakao':4, 'Lagkager':5},
'Pietro':{'Is':1,'Juice':8, 'Kakao':9, 'Lagkager':1}
}
shop_prices = {
    'Netto': {'Is':10.50,'Juice':2.25,'Kakao':4.50,'Lagkager':33.50},
    'Fakta': {'Is':4.00,'Juice':4.50,'Kakao':6.25,'Lagkager':20.00}
}
```
Hint: you can use pandas and Transpose to create dataframe: `pd.DataFrame(shoppers).T` to get the necessary shape of the dataframe/matrix. Also use df.to_numpy() to changes a Pandas DataFrame df into a numpy ndarray with only the numeric data